Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا
en: And they say: "Tales of the ancients, which he has caused to be written: and they are dictated before him morning and evening."

source: قل أنزله الذي يعلم السر في السماوات والأرض إنه كان غفورا رحيما
en: Say: "The (Qur'an) was sent down by Him who knows the mystery (that is) in the heavens and the earth: verily He is Oft-Forgiving, Most Merciful."

source: وقالوا مال هذا الرسول يأكل الطعام ويمشي في الأسواق لولا أنزل إليه ملك فيكون معه نذيرا
en: And they say: "What sort of a messenger is this, who eats food, and walks through the streets? Why has not an angel been sent down to him to give admonition with him?

source: أو يلقى إليه كنز أو تكون له جنة يأكل منها وقال الظالمون إن تتبعون إلا رجلا مسحورا
en: "Or (Why) has not a treasure been bestowed on him, or why has he (not) a garden for enjoyment?" The wicked say: "Ye follow none other than a man bewitched."

source: تبارك الذي إن شاء جعل لك خيرا من ذلك جنات تجري من تحتها الأنهار ويجعل لك قصورا
en: Blessed is He who, if that were His will, could give thee better (things) than those,- Gardens beneath which rivers flow; and He could give thee palaces (secure to dwell in).

source: بل كذبوا بالساعة وأعتدنا لمن كذب بالساعة سعيرا
en: Nay they deny the hour (of the judgment to come): but We have prepared a blazing fire for such as deny the hour:

source: إذا رأتهم من مكان بعيد سمعوا لها تغيظا وزفيرا
en: When it sees them from a place far off, they will hear its fury and its ranging sigh.

source: وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا
en: And when they are cast, bound together into a constricted place therein, they will plead for destruction there and then!

source: لا تدعوا اليوم ثبورا واحدا وادعوا ثبورا كثيرا
en: "This day plead not for a single destruction: plead for destruction oft-repeated!"

source: قل أذلك خير أم جنة الخلد التي وعد المتقون كانت لهم جزاء ومصيرا
en: Say: "Is that best, or the eternal garden, promised to the righteous? for them, that is a reward as well as a goal (of attainment).

source: لهم فيها ما يشاءون خالدين كان على ربك وعدا مسئولا
en: "For them there will be therein all that they wish for: they will dwell (there) for aye: A promise to be prayed for from thy Lord."

source: ويوم يحشرهم وما يعبدون من دون الله فيقول أأنتم أضللتم عبادي هؤلاء أم هم ضلوا السبيل
en: The day He will gather them together as well as those whom they worship besides Allah, He will ask: "Was it ye who let these My servants astray, or did they stray from the Path themselves?"

source: قالوا سبحانك ما كان ينبغي لنا أن نتخذ من دونك من أولياء ولكن متعتهم وآباءهم حتى نسوا الذكر وكانوا قوما بورا
en: They will say: "Glory to Thee! not meet was it for us that we should take for protectors others besides Thee: But Thou didst bestow, on them and their fathers, good things (in life), until they forgot the Message: for they were a people (worthless and) lost."

source: فقد كذبوكم بما تقولون فما تستطيعون صرفا ولا نصرا ومن يظلم منكم نذقه عذابا كبيرا
en: (Allah will say): "Now have they proved you liars in what ye say: so ye cannot avert (your penalty) nor (get) help." And whoever among you does wrong, him shall We cause to taste of a grievous Penalty.

source: وما أرسلنا قبلك من المرسلين إلا إنهم ليأكلون الطعام ويمشون في الأسواق وجعلنا بعضكم لبعض فتنة أتصبرون وكان ربك بصيرا
en: And the messengers whom We sent before thee were all (men) who ate food and walked through the streets: We have made some of you as a trial for others: will ye have patience? for Allah is One Who sees (all things).

source: وقال الذين لا يرجون لقاءنا لولا أنزل علينا الملائكة أو نرى ربنا لقد استكبروا في أنفسهم وعتوا عتوا كبيرا
en: Such as fear not the meeting with Us (for Judgment) say: "Why are not the angels sent down to us, or (why) do we not see our Lord?" Indeed they have an arrogant conceit of themselves, and mighty is the insolence of their impiety!

source: يوم يرون الملائكة لا بشرى يومئذ للمجرمين ويقولون حجرا محجورا
en: The Day they see the angels,- no joy will there be to the sinners that Day: The (angels) will say: "There is a barrier forbidden (to you) altogether!"

source: وقدمنا إلى ما عملوا من عمل فجعلناه هباء منثورا
en: And We shall turn to whatever deeds they did (in this life), and We shall make such deeds as floating dust scattered about.

source: أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا
en: The Companions of the Garden will be well, that Day, in their abode, and have the fairest of places for repose.

source: ويوم تشقق السماء بالغمام ونزل الملائكة تنزيلا
en: The Day the heaven shall be rent asunder with clouds, and angels shall be sent down, descending (in ranks),-

source: الملك يومئذ الحق للرحمن وكان يوما على الكافرين عسيرا
en: That Day, the dominion as of right and truth, shall be (wholly) for (Allah) Most Merciful: it will be a Day of dire difficulty for the misbelievers.

source: ويوم يعض الظالم على يديه يقول يا ليتني اتخذت مع الرسول سبيلا
en: The Day that the wrong-doer will bite at his hands, he will say, "Oh! would that I had taken a (straight) path with the Messenger!

source: يا ويلتى ليتني لم أتخذ فلانا خليلا
en: "Ah! woe is me! Would that I had never taken such a one for a friend!

source: لقد أضلني عن الذكر بعد إذ جاءني وكان الشيطان للإنسان خذولا
en: "He did lead me astray from the Message (of Allah) after it had come to me! Ah! the Evil One is but a traitor to man!"

source: وقال الرسول يا رب إن قومي اتخذوا هذا القرآن مهجورا
en: Then the Messenger will say: "O my Lord! Truly my people took this Qur'an for just foolish nonsense."

source: وكذلك جعلنا لكل نبي عدوا من المجرمين وكفى بربك هاديا ونصيرا
en: Thus have We made for every prophet an enemy among the sinners: but enough is thy Lord to guide and to help.

source: وقال الذين كفروا لولا نزل عليه القرآن جملة واحدة كذلك لنثبت به فؤادك ورتلناه ترتيلا
en: Those who reject Faith say: "Why is not the Qur'an revealed to him all at once? Thus (is it revealed), that We may strengthen thy heart thereby, and We have rehearsed it to thee in slow, well-arranged stages, gradually.

source: ولا يأتونك بمثل إلا جئناك بالحق وأحسن تفسيرا
en: And no question do they bring to thee but We reveal to thee the truth and the best explanation (thereof).

source: الذين يحشرون على وجوههم إلى جهنم أولئك شر مكانا وأضل سبيلا
en: Those who will be gathered to Hell (prone) on their faces,- they will be in an evil plight, and, as to Path, most astray.

source: ولقد آتينا موسى الكتاب وجعلنا معه أخاه هارون وزيرا
en: (Before this,) We sent Moses The Book, and appointed his brother Aaron with him as minister;

source: فقلنا اذهبا إلى القوم الذين كذبوا بآياتنا فدمرناهم تدميرا
en: And We command: "Go ye both, to the people who have rejected our Signs:" And those (people) We destroyed with utter destruction.

source: وقوم نوح لما كذبوا الرسل أغرقناهم وجعلناهم للناس آية وأعتدنا للظالمين عذابا أليما
en: And the people of Noah,- when they rejected the messengers, We drowned them, and We made them as a Sign for mankind; and We have prepared for (all) wrong-doers a grievous Penalty;-

source: وعادا وثمود وأصحاب الرس وقرونا بين ذلك كثيرا
en: As also 'Ad and Thamud, and the Companions of the Rass, and many a generation between them.

source: وكلا ضربنا له الأمثال وكلا تبرنا تتبيرا
en: To each one We set forth Parables and examples; and each one We broke to utter annihilation (for their sins).

source: ولقد أتوا على القرية التي أمطرت مطر السوء أفلم يكونوا يرونها بل كانوا لا يرجون نشورا
en: And the (Unbelievers) must indeed have passed by the town on which was rained a shower of evil: did they not then see it (with their own eyes)? But they fear not the Resurrection.

source: وإذا رأوك إن يتخذونك إلا هزوا أهذا الذي بعث الله رسولا
en: When they see thee, they treat thee no otherwise than in mockery: "Is this the one whom Allah has sent as a messenger?"

source: إن كاد ليضلنا عن آلهتنا لولا أن صبرنا عليها وسوف يعلمون حين يرون العذاب من أضل سبيلا
en: "He indeed would well-nigh have misled us from our gods, had it not been that we were constant to them!" - Soon will they know, when they see the Penalty, who it is that is most misled in Path!

source: أرأيت من اتخذ إلهه هواه أفأنت تكون عليه وكيلا
en: Seest thou such a one as taketh for his god his own passion (or impulse)? Couldst thou be a disposer of affairs for him?

source: أم تحسب أن أكثرهم يسمعون أو يعقلون إن هم إلا كالأنعام بل هم أضل سبيلا
en: Or thinkest thou that most of them listen or understand? They are only like cattle;- nay, they are worse astray in Path.

source: ألم تر إلى ربك كيف مد الظل ولو شاء لجعله ساكنا ثم جعلنا الشمس عليه دليلا
en: Hast thou not turned thy vision to thy Lord?- How He doth prolong the shadow! If He willed, He could make it stationary! then do We make the sun its guide;

source: ثم قبضناه إلينا قبضا يسيرا
en: Then We draw it in towards Ourselves,- a contraction by easy stages.

source: وهو الذي جعل لكم الليل لباسا والنوم سباتا وجعل النهار نشورا
en: And He it is Who makes the Night as a Robe for you, and Sleep as Repose, and makes the Day (as it were) a Resurrection.

source: وهو الذي أرسل الرياح بشرا بين يدي رحمته وأنزلنا من السماء ماء طهورا
en: And He it is Who sends the winds as heralds of glad tidings, going before His mercy, and We send down pure water from the sky,-

source: لنحيي به بلدة ميتا ونسقيه مما خلقنا أنعاما وأناسي كثيرا
en: That with it We may give life to a dead land, and slake the thirst of things We have created,- cattle and men in great numbers.

source: ولقد صرفناه بينهم ليذكروا فأبى أكثر الناس إلا كفورا
en: And We have distributed the (water) amongst them, in order that they may celebrate (our) praises, but most men are averse (to aught) but (rank) ingratitude.

source: ولو شئنا لبعثنا في كل قرية نذيرا
en: Had it been Our Will, We could have sent a warner to every centre of population.

source: فلا تطع الكافرين وجاهدهم به جهادا كبيرا
en: Therefore listen not to the Unbelievers, but strive against them with the utmost strenuousness, with the (Qur'an).

source: وهو الذي مرج البحرين هذا عذب فرات وهذا ملح أجاج وجعل بينهما برزخا وحجرا محجورا
en: It is He Who has let free the two bodies of flowing water: One palatable and sweet, and the other salt and bitter; yet has He made a barrier between them, a partition that is forbidden to be passed.

source: وهو الذي خلق من الماء بشرا فجعله نسبا وصهرا وكان ربك قديرا
en: It is He Who has created man from water: then has He established relationships of lineage and marriage: for thy Lord has power (over all things).

source: ويعبدون من دون الله ما لا ينفعهم ولا يضرهم وكان الكافر على ربه ظهيرا
en: Yet do they worship, besides Allah, things that can neither profit them nor harm them: and the Misbeliever is a helper (of Evil), against his own Lord!

source: وما أرسلناك إلا مبشرا ونذيرا
en: But thee We only sent to give glad tidings and admonition.

source: قل ما أسألكم عليه من أجر إلا من شاء أن يتخذ إلى ربه سبيلا
en: Say: "No reward do I ask of you for it but this: that each one who will may take a (straight) Path to his Lord."

source: وتوكل على الحي الذي لا يموت وسبح بحمده وكفى به بذنوب عباده خبيرا
en: And put thy trust in Him Who lives and dies not; and celebrate his praise; and enough is He to be acquainted with the faults of His servants;-

source: الذي خلق السماوات والأرض وما بينهما في ستة أيام ثم استوى على العرش الرحمن فاسأل به خبيرا
en: He Who created the heavens and the earth and all that is between, in six days, and is firmly established on the Throne (of Authority): Allah Most Gracious: ask thou, then, about Him of any acquainted (with such things).

source: وإذا قيل لهم اسجدوا للرحمن قالوا وما الرحمن أنسجد لما تأمرنا وزادهم نفورا
en: When it is said to them, "Prostrate to (Allah) Most Gracious!", they say, "And what is (Allah) Most Gracious? Shall we prostrate to that which thou commandest us?" And it increases their flight (from the Truth).

source: تبارك الذي جعل في السماء بروجا وجعل فيها سراجا وقمرا منيرا
en: Blessed is He Who made constellations in the skies, and placed therein a Lamp and a Moon giving light;

source: وهو الذي جعل الليل والنهار خلفة لمن أراد أن يذكر أو أراد شكورا
en: And it is He Who made the Night and the Day to follow each other: for such as have the will to celebrate His praises or to show their gratitude.

source: وعباد الرحمن الذين يمشون على الأرض هونا وإذا خاطبهم الجاهلون قالوا سلاما
en: And the servants of (Allah) Most Gracious are those who walk on the earth in humility, and when the ignorant address them, they say, "Peace!";

source: والذين يبيتون لربهم سجدا وقياما
en: Those who spend the night in adoration of their Lord prostrate and standing;

source: والذين يقولون ربنا اصرف عنا عذاب جهنم إن عذابها كان غراما
en: Those who say, "Our Lord! avert from us the Wrath of Hell, for its Wrath is indeed an affliction grievous,-

source: إنها ساءت مستقرا ومقاما
en: "Evil indeed is it as an abode, and as a place to rest in";

source: والذين إذا أنفقوا لم يسرفوا ولم يقتروا وكان بين ذلك قواما
en: Those who, when they spend, are not extravagant and not niggardly, but hold a just (balance) between those (extremes);

source: والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما
en: Those who invoke not, with Allah, any other god, nor slay such life as Allah has made sacred except for just cause, nor commit fornication; - and any that does this (not only) meets punishment.

source: يضاعف له العذاب يوم القيامة ويخلد فيه مهانا
en: (But) the Penalty on the Day of Judgment will be doubled to him, and he will dwell therein in ignominy,-

source: إلا من تاب وآمن وعمل عملا صالحا فأولئك يبدل الله سيئاتهم حسنات وكان الله غفورا رحيما
en: Unless he repents, believes, and works righteous deeds, for Allah will change the evil of such persons into good, and Allah is Oft-Forgiving, Most Merciful,

source: ومن تاب وعمل صالحا فإنه يتوب إلى الله متابا
en: And whoever repents and does good has truly turned to Allah with an (acceptable) conversion;-

source: والذين لا يشهدون الزور وإذا مروا باللغو مروا كراما
en: Those who witness no falsehood, and, if they pass by futility, they pass by it with honourable (avoidance);

source: والذين إذا ذكروا بآيات ربهم لم يخروا عليها صما وعميانا
en: Those who, when they are admonished with the Signs of their Lord, droop not down at them as if they were deaf or blind;

source: والذين يقولون ربنا هب لنا من أزواجنا وذرياتنا قرة أعين واجعلنا للمتقين إماما
en: And those who pray, "Our Lord! Grant unto us wives and offspring who will be the comfort of our eyes, and give us (the grace) to lead the righteous."

source: أولئك يجزون الغرفة بما صبروا ويلقون فيها تحية وسلاما
en: Those are the ones who will be rewarded with the highest place in heaven, because of their patient constancy: therein shall they be met with salutations and peace,

source: خالدين فيها حسنت مستقرا ومقاما
en: Dwelling therein;- how beautiful an abode and place of rest!

source: قل ما يعبأ بكم ربي لولا دعاؤكم فقد كذبتم فسوف يكون لزاما
en: Say (to the Rejecters): "My Lord is not uneasy because of you if ye call not on Him: But ye have indeed rejected (Him), and soon will come the inevitable (punishment)!"

source: طسم
en: Ta. Sin. Mim.

source: تلك آيات الكتاب المبين
en: These are verses of the Book that makes (things) clear.

source: لعلك باخع نفسك ألا يكونوا مؤمنين
en: It may be thou frettest thy soul with grief, that they do not become Believers.

source: إن نشأ ننزل عليهم من السماء آية فظلت أعناقهم لها خاضعين
en: If (such) were Our Will, We could send down to them from the sky a Sign, to which they would bend their necks in humility.

source: وما يأتيهم من ذكر من الرحمن محدث إلا كانوا عنه معرضين
en: But there comes not to them a newly-revealed Message from (Allah) Most Gracious, but they turn away therefrom.

source: فقد كذبوا فسيأتيهم أنباء ما كانوا به يستهزئون
en: They have indeed rejected (the Message): so they will know soon (enough) the truth of what they mocked at!

source: أولم يروا إلى الأرض كم أنبتنا فيها من كل زوج كريم
en: Do they not look at the earth,- how many noble things of all kinds We have produced therein?

source: إن في ذلك لآية وما كان أكثرهم مؤمنين
en: Verily, in this is a Sign: but most of them do not believe.

source: وإن ربك لهو العزيز الرحيم
en: And verily, thy Lord is He, the Exalted in Might, Most Merciful.

source: وإذ نادى ربك موسى أن ائت القوم الظالمين
en: Behold, thy Lord called Moses: "Go to the people of iniquity,-

source: قوم فرعون ألا يتقون
en: "The people of the Pharaoh: will they not fear Allah?"

source: قال رب إني أخاف أن يكذبون
en: He said: "O my Lord! I do fear that they will charge me with falsehood:

source: ويضيق صدري ولا ينطلق لساني فأرسل إلى هارون
en: "My breast will be straitened. And my speech may not go (smoothly): so send unto Aaron.

source: ولهم علي ذنب فأخاف أن يقتلون
en: "And (further), they have a charge of crime against me; and I fear they may slay me."

source: قال كلا فاذهبا بآياتنا إنا معكم مستمعون
en: Allah said: "By no means! proceed then, both of you, with Our Signs; We are with you, and will listen (to your call).

source: فأتيا فرعون فقولا إنا رسول رب العالمين
en: "So go forth, both of you, to Pharaoh, and say: 'We have been sent by the Lord and Cherisher of the worlds;

source: أن أرسل معنا بني إسرائيل
en: "'Send thou with us the Children of Israel.'"

source: قال ألم نربك فينا وليدا ولبثت فينا من عمرك سنين
en: (Pharaoh) said: "Did we not cherish thee as a child among us, and didst thou not stay in our midst many years of thy life?

source: وفعلت فعلتك التي فعلت وأنت من الكافرين
en: "And thou didst a deed of thine which (thou knowest) thou didst, and thou art an ungrateful (wretch)!"

source: قال فعلتها إذا وأنا من الضالين
en: Moses said: "I did it then, when I was in error.

source: ففررت منكم لما خفتكم فوهب لي ربي حكما وجعلني من المرسلين
en: "So I fled from you (all) when I feared you; but my Lord has (since) invested me with judgment (and wisdom) and appointed me as one of the messengers.

source: وتلك نعمة تمنها علي أن عبدت بني إسرائيل
en: "And this is the favour with which thou dost reproach me,- that thou hast enslaved the Children of Israel!"

source: قال فرعون وما رب العالمين
en: Pharaoh said: "And what is the 'Lord and Cherisher of the worlds'?"

source: قال رب السماوات والأرض وما بينهما إن كنتم موقنين
en: (Moses) said: "The Lord and Cherisher of the heavens and the earth, and all between,- if ye want to be quite sure."

source: قال لمن حوله ألا تستمعون
en: (Pharaoh) said to those around: "Did ye not listen (to what he says)?"

source: قال ربكم ورب آبائكم الأولين
en: (Moses) said: "Your Lord and the Lord of your fathers from the beginning!"

source: قال إن رسولكم الذي أرسل إليكم لمجنون
en: (Pharaoh) said: "Truly your messenger who has been sent to you is a veritable madman!"

source: قال رب المشرق والمغرب وما بينهما إن كنتم تعقلون
en: (Moses) said: "Lord of the East and the West, and all between! if ye only had sense!"

source: قال لئن اتخذت إلها غيري لأجعلنك من المسجونين
en: (Pharaoh) said: "If thou dost put forward any god other than me, I will certainly put thee in prison!"

source: قال أولو جئتك بشيء مبين
en: (Moses) said: "Even if I showed you something clear (and) convincing?"

source: قال فأت به إن كنت من الصادقين
en: (Pharaoh) said: "Show it then, if thou tellest the truth!"

source: قال للملإ حوله إن هذا لساحر عليم
en: (Pharaoh) said to the Chiefs around him: "This is indeed a sorcerer well-versed:

source: يريد أن يخرجكم من أرضكم بسحره فماذا تأمرون
en: "His plan is to get you out of your land by his sorcery; then what is it ye counsel?"

source: قالوا أرجه وأخاه وابعث في المدائن حاشرين
en: They said: "Keep him and his brother in suspense (for a while), and dispatch to the Cities heralds to collect-

source: يأتوك بكل سحار عليم
en: "And bring up to thee all (our) sorcerers well-versed."

source: فجمع السحرة لميقات يوم معلوم
en: So the sorcerers were got together for the appointment of a day well-known,

source: وقيل للناس هل أنتم مجتمعون
en: And the people were told: "Are ye (now) assembled?-

source: لعلنا نتبع السحرة إن كانوا هم الغالبين
en: "That we may follow the sorcerers (in religion) if they win?"

source: فلما جاء السحرة قالوا لفرعون أئن لنا لأجرا إن كنا نحن الغالبين
en: So when the sorcerers arrived, they said to Pharaoh: "Of course - shall we have a (suitable) reward if we win?

source: قال نعم وإنكم إذا لمن المقربين
en: He said: "Yea, (and more),- for ye shall in that case be (raised to posts) nearest (to my person)."

source: قال لهم موسى ألقوا ما أنتم ملقون
en: Moses said to them: "Throw ye - that which ye are about to throw!"

source: فألقوا حبالهم وعصيهم وقالوا بعزة فرعون إنا لنحن الغالبون
en: So they threw their ropes and their rods, and said: "By the might of Pharaoh, it is we who will certainly win!"

source: فألقى موسى عصاه فإذا هي تلقف ما يأفكون
en: Then Moses threw his rod, when, behold, it straightway swallows up all the falsehoods which they fake!

source: فألقي السحرة ساجدين
en: Then did the sorcerers fall down, prostrate in adoration,

source: قال آمنتم له قبل أن آذن لكم إنه لكبيركم الذي علمكم السحر فلسوف تعلمون لأقطعن أيديكم وأرجلكم من خلاف ولأصلبنكم أجمعين
en: Said (Pharaoh): "Believe ye in Him before I give you permission? surely he is your leader, who has taught you sorcery! but soon shall ye know! Be sure I will cut off your hands and your feet on opposite sides, and I will cause you all to die on the cross!"

source: قالوا لا ضير إنا إلى ربنا منقلبون
en: They said: "No matter! for us, we shall but return to our Lord!

source: إنا نطمع أن يغفر لنا ربنا خطايانا أن كنا أول المؤمنين
en: "Only, our desire is that our Lord will forgive us our faults, that we may become foremost among the believers!"

source: وأوحينا إلى موسى أن أسر بعبادي إنكم متبعون
en: By inspiration we told Moses: "Travel by night with my servants; for surely ye shall be pursued."

source: فأرسل فرعون في المدائن حاشرين
en: Then Pharaoh sent heralds to (all) the Cities,

source: إن هؤلاء لشرذمة قليلون
en: (Saying): "These (Israelites) are but a small band,

source: وإنهم لنا لغائظون
en: "And they are raging furiously against us;

source: وإنا لجميع حاذرون
en: "But we are a multitude amply fore-warned."

source: فأخرجناهم من جنات وعيون
en: So We expelled them from gardens, springs,

source: وكنوز ومقام كريم
en: Treasures, and every kind of honourable position;

source: كذلك وأورثناها بني إسرائيل
en: Thus it was, but We made the Children of Israel inheritors of such things.

source: فأتبعوهم مشرقين
en: So they pursued them at sunrise.

source: فلما تراءى الجمعان قال أصحاب موسى إنا لمدركون
en: And when the two bodies saw each other, the people of Moses said: "We are sure to be overtaken."

source: قال كلا إن معي ربي سيهدين
en: (Moses) said: "By no means! my Lord is with me! Soon will He guide me!"

source: فأوحينا إلى موسى أن اضرب بعصاك البحر فانفلق فكان كل فرق كالطود العظيم
en: Then We told Moses by inspiration: "Strike the sea with thy rod." So it divided, and each separate part became like the huge, firm mass of a mountain.

source: وأزلفنا ثم الآخرين
en: And We made the other party approach thither.

source: وأنجينا موسى ومن معه أجمعين
en: We delivered Moses and all who were with him;

source: ثم أغرقنا الآخرين
en: But We drowned the others.

source: واتل عليهم نبأ إبراهيم
en: And rehearse to them (something of) Abraham's story.

source: إذ قال لأبيه وقومه ما تعبدون
en: Behold, he said to his father and his people: "What worship ye?"

source: قالوا نعبد أصناما فنظل لها عاكفين
en: They said: "We worship idols, and we remain constantly in attendance on them."

source: قال هل يسمعونكم إذ تدعون
en: He said: "Do they listen to you when ye call (on them)?"

source: أو ينفعونكم أو يضرون
en: "Or do you good or harm?"

source: قالوا بل وجدنا آباءنا كذلك يفعلون
en: They said: "Nay, but we found our fathers doing thus (what we do)."

source: قال أفرأيتم ما كنتم تعبدون
en: He said: "Do ye then see whom ye have been worshipping,-
